In [57]:
%load_ext autoreload
%autoreload 2

import utils
from utils import load_ufo_data

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [19]:
df = load_ufo_data()
df.head()

,sighted_at,reported_at,location,duration,shape,description
0,1995-10-09,1995-10-09,"Iowa City, IA",NaN,NaN,"Man repts. witnessing &quot;flash, followed by..."
1,1995-10-10,1995-10-11,"Milwaukee, WI",2 min.,NaN,"Man on Hwy 43 SW of Milwaukee sees large, bri..."
2,1995-01-01,1995-01-03,"Shelton, WA",NaN,NaN,Telephoned Report:CA woman visiting daughter w...
3,1995-05-10,1995-05-10,"Columbia, MO",2 min.,NaN,Man repts. son&apos;s bizarre sighting of smal...
4,1995-06-11,1995-06-14,"Seattle, WA",NaN,NaN,Anonymous caller repts. sighting 4 ufo&apos;s ...

In [75]:
from utils import split_location

v = split_location(df)
v.head()

,sighted_at,reported_at,location,duration,shape,description,municipality,state,is_usa
0,1995-10-09,1995-10-09,"Iowa City, IA",NaN,NaN,"Man repts. witnessing &quot;flash, followed by...",iowa city,IA,True
1,1995-10-10,1995-10-11,"Milwaukee, WI",2 min.,NaN,"Man on Hwy 43 SW of Milwaukee sees large, bri...",milwaukee,WI,True
2,1995-01-01,1995-01-03,"Shelton, WA",NaN,NaN,Telephoned Report:CA woman visiting daughter w...,shelton,WA,True
3,1995-05-10,1995-05-10,"Columbia, MO",2 min.,NaN,Man repts. son&apos;s bizarre sighting of smal...,columbia,MO,True
4,1995-06-11,1995-06-14,"Seattle, WA",NaN,NaN,Anonymous caller repts. sighting 4 ufo&apos;s ...,seattle,WA,True

In [116]:
print(v.is_usa.sum())

unique_mun = v.loc[v.is_usa, ['municipality', 'state']].apply(', '.join, axis=1) 
unique_mun = unique_mun.unique().tolist()
print(len(unique_mun))

def chunks(l, n): # Ned Batchelder's `chunks` function
    """Yield successive n-sized chunks from l."""
    for i in range(0, len(l), n):
        yield l[i:i + n]

splits = list(chunks(unique_mun, len(unique_mun) // 5 ))

#for i, s in enumerate(splits):
#    with open('Data/mun_{}.txt'.format(i) ,'w') as f:
#        f.write('\r\n'.join(s))

52086
15333

In [113]:
from utils import simple_csv_saver
simple_csv_saver(v, 'Data/ufo_awesome_modified.csv', compression='gzip')

In [114]:
from utils import simple_csv_loader
v2 = simple_csv_loader('Data/ufo_awesome_modified.csv', compression='gzip')
v2.head()

,sighted_at,reported_at,location,duration,shape,description,municipality,state,is_usa
0,1995-10-09,1995-10-09,"Iowa City, IA",NaN,NaN,"Man repts. witnessing &quot;flash, followed by...",iowa city,IA,True
1,1995-10-10,1995-10-11,"Milwaukee, WI",2 min.,NaN,"Man on Hwy 43 SW of Milwaukee sees large, bri...",milwaukee,WI,True
2,1995-01-01,1995-01-03,"Shelton, WA",NaN,NaN,Telephoned Report:CA woman visiting daughter w...,shelton,WA,True
3,1995-05-10,1995-05-10,"Columbia, MO",2 min.,NaN,Man repts. son&apos;s bizarre sighting of smal...,columbia,MO,True
4,1995-06-11,1995-06-14,"Seattle, WA",NaN,NaN,Anonymous caller repts. sighting 4 ufo&apos;s ...,seattle,WA,True

In [ ]:
import pyodbc
conn_str = (
    r'DRIVER={Driver do Microsoft Access (*.mdb)};'
    r'sadc_2015_state_a_m.dat;'
    )
cnxn = pyodbc.connect(conn_str)
crsr = cnxn.cursor()
for table_info in crsr.tables(tableType='TABLE'):
    print(table_info.table_name)
SQL = 'SELECT top 5 * FROM SADCQ;'
rows = crsr.execute(SQL).fetchall()
for row in rows:
	print (row)
crsr.close()
cnxn.close()

In [91]:
from datacleaner import *
df = clean_census_data(save=False)
df.head()

  municipality state  census  census_year
0    abbeville    AL   26153         2000
1   adamsville    AL    5033         2000
2      addison    AL   36084         2000
3        akron    AL  216899         2000
4    alabaster    AL   23965         2000

In [108]:
df = clean_airport_data(save=True)
df.head()

,elevation_ft,municipality,name,type,airport_lon,airport_lat
0,11,bensalem,Total Rf Heliport,heliport,-74.933601,40.070801
1,3435,leoti,Aero B Ranch Airport,small_airport,-101.473911,38.704022
2,450,anchor point,Lowell Field,small_airport,-151.695999,59.949200
3,820,harvest,Epps Airpark,small_airport,-86.770302,34.864799
5,1100,alex,Fulton Airport,small_airport,-97.818019,34.942803

In [109]:
df.type.unique()

array(['heliport', 'small_airport', 'seaplane_base', 'balloonport',
       'medium_airport', 'large_airport'], dtype=object)

In [110]:
utils.simple_csv_loader('Data/airport_codes_clean.csv').head()

,elevation_ft,municipality,name,type,airport_lon,airport_lat
0,11.0,bensalem,Total Rf Heliport,heliport,-74.933601,40.070801
1,3435.0,leoti,Aero B Ranch Airport,small_airport,-101.473911,38.704022
2,450.0,anchor point,Lowell Field,small_airport,-151.695999,59.949200
3,820.0,harvest,Epps Airpark,small_airport,-86.770302,34.864799
4,1100.0,alex,Fulton Airport,small_airport,-97.818019,34.942803